003_write_orioledb_compress_all_max_level/pgbench_write_2022-05-22T18:36:16.424555558.log
progress: 10.0 s, 41984.9 tps, lat 1.160 ms stddev 1.405
progress: 20.0 s, 42010.8 tps, lat 1.166 ms stddev 1.726
progress: 30.0 s, 42071.8 tps, lat 1.164 ms stddev 2.188
progress: 40.0 s, 42193.6 tps, lat 1.161 ms stddev 1.668
progress: 50.0 s, 42011.2 tps, lat 1.166 ms stddev 2.003
progress: 60.0 s, 42279.2 tps, lat 1.158 ms stddev 2.108
progress: 70.0 s, 42143.7 tps, lat 1.162 ms stddev 1.640
progress: 80.0 s, 42180.4 tps, lat 1.159 ms stddev 1.385
progress: 90.0 s, 41781.8 tps, lat 1.173 ms stddev 2.153
progress: 100.0 s, 42083.5 tps, lat 1.163 ms stddev 1.763
progress: 110.0 s, 41876.7 tps, lat 1.170 ms stddev 2.603
progress: 120.0 s, 41507.9 tps, lat 1.180 ms stddev 1.825
progress: 130.0 s, 42023.9 tps, lat 1.165 ms stddev 1.789
progress: 140.0 s, 41930.6 tps, lat 1.168 ms stddev 1.016
progress: 150.0 s, 41826.0 tps, lat 1.170 ms stddev 1.008
progress: 160.0 s, 42051.6 tps, lat 1.165 ms stddev 2.023
progress: 170.0 s, 41917.3 tps, lat 1.168 ms stddev 1.455
progress: 180.0 s, 42041.9 tps, lat 1.165 ms stddev 1.084
progress: 190.0 s, 41802.7 tps, lat 1.172 ms stddev 1.705
progress: 200.0 s, 42160.8 tps, lat 1.162 ms stddev 0.963
progress: 210.0 s, 41920.5 tps, lat 1.168 ms stddev 1.480
progress: 220.0 s, 41921.5 tps, lat 1.168 ms stddev 1.024
progress: 230.0 s, 41664.5 tps, lat 1.175 ms stddev 0.929
progress: 240.0 s, 41888.2 tps, lat 1.169 ms stddev 1.351
progress: 250.0 s, 41745.9 tps, lat 1.173 ms stddev 0.925
progress: 260.0 s, 41965.2 tps, lat 1.167 ms stddev 1.379
progress: 270.0 s, 42082.2 tps, lat 1.164 ms stddev 0.899
progress: 280.0 s, 42313.8 tps, lat 1.157 ms stddev 0.911
progress: 290.0 s, 42204.2 tps, lat 1.160 ms stddev 1.433
progress: 300.0 s, 42142.8 tps, lat 1.160 ms stddev 1.919
progress: 310.0 s, 41917.0 tps, lat 1.171 ms stddev 1.355
progress: 320.0 s, 41831.4 tps, lat 1.171 ms stddev 1.343
progress: 330.0 s, 41764.7 tps, lat 1.173 ms stddev 0.972
progress: 340.0 s, 41973.5 tps, lat 1.167 ms stddev 0.879
progress: 350.0 s, 41511.4 tps, lat 1.180 ms stddev 1.561
progress: 360.0 s, 41952.0 tps, lat 1.168 ms stddev 0.841
progress: 370.0 s, 41860.3 tps, lat 1.170 ms stddev 0.879
progress: 380.0 s, 41342.6 tps, lat 1.185 ms stddev 1.315
progress: 390.0 s, 40705.9 tps, lat 1.204 ms stddev 0.990
progress: 400.0 s, 41537.7 tps, lat 1.179 ms stddev 0.781
progress: 410.0 s, 41576.4 tps, lat 1.178 ms stddev 1.481
progress: 420.0 s, 41168.6 tps, lat 1.190 ms stddev 0.911
progress: 430.0 s, 41310.5 tps, lat 1.186 ms stddev 0.821
progress: 440.0 s, 40705.8 tps, lat 1.204 ms stddev 0.914
progress: 450.0 s, 40833.5 tps, lat 1.200 ms stddev 0.962
progress: 460.0 s, 41209.6 tps, lat 1.189 ms stddev 0.929
progress: 470.0 s, 41406.3 tps, lat 1.183 ms stddev 0.989
progress: 480.0 s, 39288.1 tps, lat 1.248 ms stddev 1.279
progress: 490.0 s, 34802.4 tps, lat 1.414 ms stddev 1.817
progress: 500.0 s, 33824.3 tps, lat 1.454 ms stddev 2.058
progress: 510.0 s, 33457.6 tps, lat 1.472 ms stddev 2.053
progress: 520.0 s, 33743.1 tps, lat 1.457 ms stddev 1.993
progress: 530.0 s, 33638.8 tps, lat 1.464 ms stddev 2.084
progress: 540.0 s, 33970.1 tps, lat 1.449 ms stddev 2.118
progress: 550.0 s, 32275.5 tps, lat 1.526 ms stddev 2.421
progress: 560.0 s, 30629.5 tps, lat 1.609 ms stddev 2.840
progress: 570.0 s, 30541.3 tps, lat 1.614 ms stddev 2.843
progress: 580.0 s, 30804.0 tps, lat 1.600 ms stddev 2.813
progress: 590.0 s, 30650.5 tps, lat 1.606 ms stddev 2.827
progress: 600.0 s, 30656.1 tps, lat 1.610 ms stddev 2.874
progress: 610.0 s, 30767.8 tps, lat 1.602 ms stddev 2.800
progress: 620.0 s, 30686.4 tps, lat 1.607 ms stddev 2.936
progress: 630.0 s, 30553.6 tps, lat 1.612 ms stddev 2.857
progress: 640.0 s, 30544.7 tps, lat 1.616 ms stddev 2.916
progress: 650.0 s, 30297.8 tps, lat 1.627 ms stddev 2.852
progress: 660.0 s, 30382.4 tps, lat 1.622 ms stddev 2.807
progress: 670.0 s, 30323.4 tps, lat 1.625 ms stddev 2.849
progress: 680.0 s, 30188.8 tps, lat 1.633 ms stddev 2.845
progress: 690.0 s, 34159.1 tps, lat 1.439 ms stddev 2.098
progress: 700.0 s, 32139.7 tps, lat 1.533 ms stddev 2.327
progress: 710.0 s, 33836.4 tps, lat 1.455 ms stddev 1.977
progress: 720.0 s, 32963.3 tps, lat 1.494 ms stddev 2.173
progress: 730.0 s, 30691.4 tps, lat 1.606 ms stddev 2.764
progress: 740.0 s, 30354.2 tps, lat 1.623 ms stddev 2.842
progress: 750.0 s, 30430.1 tps, lat 1.620 ms stddev 2.916
progress: 760.0 s, 30805.4 tps, lat 1.601 ms stddev 2.816
progress: 770.0 s, 32797.0 tps, lat 1.501 ms stddev 2.223
progress: 780.0 s, 30520.3 tps, lat 1.615 ms stddev 2.734
progress: 790.0 s, 31012.6 tps, lat 1.589 ms stddev 2.648
progress: 800.0 s, 31514.0 tps, lat 1.563 ms stddev 2.536
progress: 810.0 s, 32327.8 tps, lat 1.523 ms stddev 2.298
progress: 820.0 s, 32273.8 tps, lat 1.525 ms stddev 2.379
progress: 830.0 s, 31710.5 tps, lat 1.554 ms stddev 2.361
progress: 840.0 s, 30837.9 tps, lat 1.598 ms stddev 2.534
progress: 850.0 s, 30933.6 tps, lat 1.593 ms stddev 2.537
progress: 860.0 s, 30888.9 tps, lat 1.597 ms stddev 2.549
progress: 870.0 s, 31086.4 tps, lat 1.585 ms stddev 2.525
progress: 880.0 s, 30897.6 tps, lat 1.595 ms stddev 2.540
progress: 890.0 s, 30732.9 tps, lat 1.603 ms stddev 2.546
progress: 900.0 s, 31172.3 tps, lat 1.579 ms stddev 2.472
progress: 910.0 s, 31724.9 tps, lat 1.554 ms stddev 2.300
progress: 920.0 s, 30886.9 tps, lat 1.596 ms stddev 2.441
progress: 930.0 s, 31047.6 tps, lat 1.587 ms stddev 2.468
progress: 940.0 s, 31262.5 tps, lat 1.576 ms stddev 2.426
progress: 950.0 s, 30752.9 tps, lat 1.603 ms stddev 2.461
progress: 960.0 s, 31085.4 tps, lat 1.585 ms stddev 2.405
progress: 970.0 s, 31003.4 tps, lat 1.589 ms stddev 2.432
progress: 980.0 s, 31262.1 tps, lat 1.577 ms stddev 2.386
progress: 990.0 s, 31371.8 tps, lat 1.571 ms stddev 2.317
progress: 1000.0 s, 31294.3 tps, lat 1.575 ms stddev 2.301
progress: 1010.0 s, 30710.5 tps, lat 1.603 ms stddev 2.453
progress: 1020.0 s, 30123.3 tps, lat 1.638 ms stddev 2.712
progress: 1030.0 s, 30468.2 tps, lat 1.619 ms stddev 2.614
progress: 1040.0 s, 30518.2 tps, lat 1.613 ms stddev 2.499
progress: 1050.0 s, 30950.1 tps, lat 1.594 ms stddev 2.395
progress: 1060.0 s, 31270.6 tps, lat 1.576 ms stddev 2.316
progress: 1070.0 s, 32026.4 tps, lat 1.538 ms stddev 2.042
progress: 1080.0 s, 32546.7 tps, lat 1.511 ms stddev 1.969
progress: 1090.0 s, 31671.4 tps, lat 1.558 ms stddev 2.220
progress: 1100.0 s, 31939.4 tps, lat 1.543 ms stddev 2.010
progress: 1110.0 s, 31737.6 tps, lat 1.553 ms stddev 2.026
progress: 1120.0 s, 30904.6 tps, lat 1.595 ms stddev 2.272
progress: 1130.0 s, 29895.5 tps, lat 1.649 ms stddev 2.570
progress: 1140.0 s, 31367.9 tps, lat 1.572 ms stddev 2.184
progress: 1150.0 s, 30704.9 tps, lat 1.605 ms stddev 2.209
progress: 1160.0 s, 29885.8 tps, lat 1.650 ms stddev 2.445
progress: 1170.0 s, 30409.7 tps, lat 1.622 ms stddev 2.434
progress: 1180.0 s, 30733.1 tps, lat 1.604 ms stddev 2.320
progress: 1190.0 s, 30014.8 tps, lat 1.643 ms stddev 2.403
progress: 1200.0 s, 30160.3 tps, lat 1.636 ms stddev 2.385
progress: 1210.0 s, 30398.4 tps, lat 1.621 ms stddev 2.364
progress: 1220.0 s, 30019.2 tps, lat 1.644 ms stddev 2.564
progress: 1230.0 s, 30272.3 tps, lat 1.630 ms stddev 2.546
progress: 1240.0 s, 30852.1 tps, lat 1.598 ms stddev 2.354
progress: 1250.0 s, 30504.7 tps, lat 1.616 ms stddev 2.373
progress: 1260.0 s, 30412.8 tps, lat 1.621 ms stddev 2.360
progress: 1270.0 s, 30092.1 tps, lat 1.640 ms stddev 2.448
progress: 1280.0 s, 29888.7 tps, lat 1.650 ms stddev 2.524
progress: 1290.0 s, 30554.8 tps, lat 1.614 ms stddev 2.381
progress: 1300.0 s, 30912.4 tps, lat 1.595 ms stddev 2.270
progress: 1310.0 s, 30301.1 tps, lat 1.627 ms stddev 2.352
progress: 1320.0 s, 30451.4 tps, lat 1.619 ms stddev 2.338
progress: 1330.0 s, 30311.1 tps, lat 1.627 ms stddev 2.388
progress: 1340.0 s, 29923.4 tps, lat 1.648 ms stddev 2.459
progress: 1350.0 s, 30923.3 tps, lat 1.594 ms stddev 2.301
progress: 1360.0 s, 31138.1 tps, lat 1.584 ms stddev 2.128
progress: 1370.0 s, 30647.9 tps, lat 1.609 ms stddev 2.156
progress: 1380.0 s, 29977.0 tps, lat 1.646 ms stddev 2.340
progress: 1390.0 s, 29437.3 tps, lat 1.676 ms stddev 2.379
progress: 1400.0 s, 28487.9 tps, lat 1.733 ms stddev 2.487
progress: 1410.0 s, 28438.6 tps, lat 1.736 ms stddev 2.535
progress: 1420.0 s, 28630.4 tps, lat 1.723 ms stddev 2.503
progress: 1430.0 s, 27725.4 tps, lat 1.783 ms stddev 2.579
progress: 1440.0 s, 27327.2 tps, lat 1.806 ms stddev 2.657
progress: 1450.0 s, 27472.6 tps, lat 1.799 ms stddev 2.664
progress: 1460.0 s, 27610.5 tps, lat 1.788 ms stddev 2.680
progress: 1470.0 s, 26880.2 tps, lat 1.838 ms stddev 2.794
progress: 1480.0 s, 26852.2 tps, lat 1.840 ms stddev 2.852
progress: 1490.0 s, 27141.6 tps, lat 1.821 ms stddev 2.718
progress: 1500.0 s, 27956.6 tps, lat 1.766 ms stddev 2.652
progress: 1510.0 s, 28213.4 tps, lat 1.749 ms stddev 2.569
progress: 1520.0 s, 27266.8 tps, lat 1.812 ms stddev 2.724
progress: 1530.0 s, 27127.3 tps, lat 1.819 ms stddev 2.749
progress: 1540.0 s, 27753.2 tps, lat 1.781 ms stddev 2.774
progress: 1550.0 s, 28083.5 tps, lat 1.758 ms stddev 2.606
progress: 1560.0 s, 27460.6 tps, lat 1.799 ms stddev 2.674
progress: 1570.0 s, 27201.1 tps, lat 1.816 ms stddev 2.718
progress: 1580.0 s, 27488.7 tps, lat 1.797 ms stddev 2.651
progress: 1590.0 s, 28207.1 tps, lat 1.751 ms stddev 2.532
progress: 1600.0 s, 27564.8 tps, lat 1.793 ms stddev 2.596
progress: 1610.0 s, 27034.7 tps, lat 1.827 ms stddev 2.631
progress: 1620.0 s, 27120.0 tps, lat 1.823 ms stddev 2.626
progress: 1630.0 s, 26639.2 tps, lat 1.855 ms stddev 2.656
progress: 1640.0 s, 25925.3 tps, lat 1.906 ms stddev 2.758
progress: 1650.0 s, 25814.5 tps, lat 1.916 ms stddev 2.755
progress: 1660.0 s, 26483.2 tps, lat 1.867 ms stddev 2.728
progress: 1670.0 s, 25628.2 tps, lat 1.930 ms stddev 2.799
progress: 1680.0 s, 25178.7 tps, lat 1.964 ms stddev 2.859
progress: 1690.0 s, 25452.9 tps, lat 1.943 ms stddev 2.858
progress: 1700.0 s, 25500.8 tps, lat 1.939 ms stddev 2.840
progress: 1710.0 s, 24735.3 tps, lat 2.000 ms stddev 2.940
progress: 1720.0 s, 24853.1 tps, lat 1.990 ms stddev 2.899
progress: 1730.0 s, 25009.4 tps, lat 1.978 ms stddev 2.862
progress: 1740.0 s, 25323.2 tps, lat 1.954 ms stddev 2.844
progress: 1750.0 s, 24969.1 tps, lat 1.981 ms stddev 2.919
progress: 1760.0 s, 24217.2 tps, lat 2.042 ms stddev 3.020
progress: 1770.0 s, 24778.8 tps, lat 1.997 ms stddev 2.979
progress: 1780.0 s, 25263.9 tps, lat 1.957 ms stddev 2.832
progress: 1790.0 s, 24095.5 tps, lat 2.053 ms stddev 2.962
progress: 1800.0 s, 24359.7 tps, lat 2.031 ms stddev 2.975
progress: 1810.0 s, 24578.5 tps, lat 2.014 ms stddev 2.918
progress: 1820.0 s, 24184.2 tps, lat 2.044 ms stddev 2.917
progress: 1830.0 s, 24285.7 tps, lat 2.038 ms stddev 2.966
progress: 1840.0 s, 24174.1 tps, lat 2.049 ms stddev 2.954
progress: 1850.0 s, 23282.5 tps, lat 2.124 ms stddev 3.267
progress: 1860.0 s, 23844.7 tps, lat 2.076 ms stddev 2.960
progress: 1870.0 s, 23479.9 tps, lat 2.108 ms stddev 3.020
progress: 1880.0 s, 20965.1 tps, lat 2.365 ms stddev 3.993
progress: 1890.0 s, 23669.8 tps, lat 2.091 ms stddev 2.998
progress: 1900.0 s, 23332.0 tps, lat 2.122 ms stddev 3.122
progress: 1910.0 s, 20397.6 tps, lat 2.429 ms stddev 4.561
progress: 1920.0 s, 23010.1 tps, lat 2.154 ms stddev 3.100
progress: 1930.0 s, 23356.9 tps, lat 2.120 ms stddev 3.056
progress: 1940.0 s, 22539.8 tps, lat 2.197 ms stddev 3.201
progress: 1950.0 s, 21536.7 tps, lat 2.301 ms stddev 3.484
progress: 1960.0 s, 22771.8 tps, lat 2.174 ms stddev 3.139
progress: 1970.0 s, 22727.8 tps, lat 2.181 ms stddev 3.130
progress: 1980.0 s, 20542.5 tps, lat 2.413 ms stddev 3.588
progress: 1990.0 s, 22229.9 tps, lat 2.230 ms stddev 3.203
progress: 2000.0 s, 22384.8 tps, lat 2.213 ms stddev 3.174
progress: 2010.0 s, 19035.6 tps, lat 2.604 ms stddev 5.266
progress: 2020.0 s, 21949.8 tps, lat 2.258 ms stddev 3.218
progress: 2030.0 s, 21875.0 tps, lat 2.267 ms stddev 3.250
progress: 2040.0 s, 20027.7 tps, lat 2.477 ms stddev 3.835
progress: 2050.0 s, 21881.7 tps, lat 2.265 ms stddev 3.248
progress: 2060.0 s, 21576.9 tps, lat 2.297 ms stddev 3.281
progress: 2070.0 s, 15200.5 tps, lat 3.268 ms stddev 8.135
progress: 2080.0 s, 21511.2 tps, lat 2.304 ms stddev 3.268
progress: 2090.0 s, 21511.2 tps, lat 2.304 ms stddev 3.277
progress: 2100.0 s, 19900.3 tps, lat 2.490 ms stddev 3.784
progress: 2110.0 s, 19937.0 tps, lat 2.489 ms stddev 3.645
progress: 2120.0 s, 21049.5 tps, lat 2.354 ms stddev 3.315
progress: 2130.0 s, 20796.8 tps, lat 2.382 ms stddev 3.347
progress: 2140.0 s, 14815.4 tps, lat 3.354 ms stddev 7.629
progress: 2150.0 s, 20449.5 tps, lat 2.423 ms stddev 3.406
progress: 2160.0 s, 20792.0 tps, lat 2.386 ms stddev 3.344
progress: 2170.0 s, 17977.1 tps, lat 2.760 ms stddev 4.077
progress: 2180.0 s, 20130.7 tps, lat 2.463 ms stddev 3.453
progress: 2190.0 s, 20166.6 tps, lat 2.459 ms stddev 3.471
progress: 2200.0 s, 18009.1 tps, lat 2.757 ms stddev 3.873
progress: 2210.0 s, 20334.6 tps, lat 2.437 ms stddev 3.424
progress: 2220.0 s, 19943.7 tps, lat 2.489 ms stddev 3.524
progress: 2230.0 s, 17090.9 tps, lat 2.904 ms stddev 4.032
progress: 2240.0 s, 19419.2 tps, lat 2.554 ms stddev 3.542
progress: 2250.0 s, 19606.7 tps, lat 2.530 ms stddev 3.531
progress: 2260.0 s, 19175.5 tps, lat 2.588 ms stddev 3.574
progress: 2270.0 s, 16979.1 tps, lat 2.925 ms stddev 4.114
progress: 2280.0 s, 19901.9 tps, lat 2.491 ms stddev 3.467
progress: 2290.0 s, 19759.8 tps, lat 2.511 ms stddev 3.508
progress: 2300.0 s, 13884.3 tps, lat 3.581 ms stddev 6.851
progress: 2310.0 s, 19551.6 tps, lat 2.539 ms stddev 3.523
progress: 2320.0 s, 19658.6 tps, lat 2.523 ms stddev 3.500
progress: 2330.0 s, 14255.0 tps, lat 3.488 ms stddev 6.470
progress: 2340.0 s, 19366.4 tps, lat 2.562 ms stddev 3.579
progress: 2350.0 s, 19320.4 tps, lat 2.570 ms stddev 3.585
progress: 2360.0 s, 17266.2 tps, lat 2.874 ms stddev 3.986
progress: 2370.0 s, 18639.3 tps, lat 2.665 ms stddev 3.750
progress: 2380.0 s, 18963.2 tps, lat 2.618 ms stddev 3.620
progress: 2390.0 s, 18838.4 tps, lat 2.635 ms stddev 3.654
progress: 2400.0 s, 15813.4 tps, lat 3.143 ms stddev 4.318
progress: 2410.0 s, 18906.6 tps, lat 2.626 ms stddev 3.631
progress: 2420.0 s, 18653.3 tps, lat 2.660 ms stddev 3.686
progress: 2430.0 s, 15367.0 tps, lat 3.236 ms stddev 4.389
progress: 2440.0 s, 18807.7 tps, lat 2.640 ms stddev 3.631
progress: 2450.0 s, 18579.3 tps, lat 2.672 ms stddev 3.694
progress: 2460.0 s, 15448.7 tps, lat 3.216 ms stddev 4.361
progress: 2470.0 s, 18163.3 tps, lat 2.734 ms stddev 3.761
progress: 2480.0 s, 18425.1 tps, lat 2.695 ms stddev 3.691
progress: 2490.0 s, 15671.7 tps, lat 3.171 ms stddev 4.284
progress: 2500.0 s, 18280.0 tps, lat 2.714 ms stddev 3.714
progress: 2510.0 s, 18209.8 tps, lat 2.730 ms stddev 3.753
progress: 2520.0 s, 18263.5 tps, lat 2.718 ms stddev 3.711
progress: 2530.0 s, 15482.4 tps, lat 3.212 ms stddev 4.254
progress: 2540.0 s, 17796.3 tps, lat 2.791 ms stddev 3.778
progress: 2550.0 s, 17670.5 tps, lat 2.811 ms stddev 3.811
progress: 2560.0 s, 14877.7 tps, lat 3.340 ms stddev 4.534
progress: 2570.0 s, 17830.8 tps, lat 2.785 ms stddev 3.779
progress: 2580.0 s, 17576.7 tps, lat 2.825 ms stddev 3.823
progress: 2590.0 s, 14560.7 tps, lat 3.416 ms stddev 4.666
progress: 2600.0 s, 17482.4 tps, lat 2.840 ms stddev 3.812
progress: 2610.0 s, 17506.0 tps, lat 2.838 ms stddev 3.839
progress: 2620.0 s, 14281.9 tps, lat 3.480 ms stddev 4.769
progress: 2630.0 s, 17303.9 tps, lat 2.871 ms stddev 3.880
progress: 2640.0 s, 17638.6 tps, lat 2.817 ms stddev 3.798
progress: 2650.0 s, 17413.8 tps, lat 2.855 ms stddev 3.864
progress: 2660.0 s, 13795.0 tps, lat 3.605 ms stddev 5.151
progress: 2670.0 s, 17131.6 tps, lat 2.899 ms stddev 3.875
progress: 2680.0 s, 17047.5 tps, lat 2.915 ms stddev 3.878
progress: 2690.0 s, 14752.5 tps, lat 3.370 ms stddev 4.383
progress: 2700.0 s, 16829.3 tps, lat 2.953 ms stddev 3.940
progress: 2710.0 s, 16966.7 tps, lat 2.930 ms stddev 3.930
progress: 2720.0 s, 14587.3 tps, lat 3.408 ms stddev 4.471
progress: 2730.0 s, 16981.8 tps, lat 2.927 ms stddev 3.892
progress: 2740.0 s, 16791.2 tps, lat 2.959 ms stddev 3.959
progress: 2750.0 s, 13153.9 tps, lat 3.781 ms stddev 7.207
progress: 2760.0 s, 15720.9 tps, lat 3.163 ms stddev 4.156
progress: 2770.0 s, 16978.7 tps, lat 2.925 ms stddev 3.884
progress: 2780.0 s, 16208.8 tps, lat 3.069 ms stddev 4.023
progress: 2790.0 s, 13972.1 tps, lat 3.557 ms stddev 4.636
progress: 2800.0 s, 16603.4 tps, lat 2.994 ms stddev 3.949
progress: 2810.0 s, 15703.9 tps, lat 3.165 ms stddev 6.086
progress: 2820.0 s, 14489.9 tps, lat 3.433 ms stddev 4.425
progress: 2830.0 s, 16313.5 tps, lat 3.046 ms stddev 4.046
progress: 2840.0 s, 16402.4 tps, lat 3.031 ms stddev 3.991
progress: 2850.0 s, 12560.2 tps, lat 3.961 ms stddev 5.935
progress: 2860.0 s, 16351.8 tps, lat 3.041 ms stddev 4.043
progress: 2870.0 s, 15837.3 tps, lat 3.138 ms stddev 4.123
progress: 2880.0 s, 14996.9 tps, lat 3.316 ms stddev 6.182
progress: 2890.0 s, 13951.4 tps, lat 3.565 ms stddev 4.684
progress: 2900.0 s, 16254.3 tps, lat 3.058 ms stddev 4.020
progress: 2910.0 s, 15355.4 tps, lat 3.238 ms stddev 4.183
progress: 2920.0 s, 11908.8 tps, lat 4.178 ms stddev 7.669
progress: 2930.0 s, 16007.4 tps, lat 3.105 ms stddev 4.037
progress: 2940.0 s, 16187.9 tps, lat 3.073 ms stddev 4.021
progress: 2950.0 s, 13064.5 tps, lat 3.807 ms stddev 5.188
progress: 2960.0 s, 15567.4 tps, lat 3.193 ms stddev 4.143
progress: 2970.0 s, 15799.6 tps, lat 3.147 ms stddev 4.092
progress: 2980.0 s, 14157.6 tps, lat 3.515 ms stddev 5.515
progress: 2990.0 s, 13333.7 tps, lat 3.729 ms stddev 5.731
progress: 3000.0 s, 15616.1 tps, lat 3.185 ms stddev 4.143
progress: 3010.0 s, 14876.0 tps, lat 3.341 ms stddev 4.570
progress: 3020.0 s, 12400.0 tps, lat 4.015 ms stddev 6.877
progress: 3030.0 s, 15622.3 tps, lat 3.183 ms stddev 4.135
progress: 3040.0 s, 15546.1 tps, lat 3.200 ms stddev 4.146
progress: 3050.0 s, 12309.2 tps, lat 4.042 ms stddev 6.010
progress: 3060.0 s, 15498.8 tps, lat 3.207 ms stddev 4.125
progress: 3070.0 s, 15520.8 tps, lat 3.205 ms stddev 4.106
progress: 3080.0 s, 13777.6 tps, lat 3.607 ms stddev 4.481
progress: 3090.0 s, 13420.8 tps, lat 3.710 ms stddev 5.564
progress: 3100.0 s, 15422.1 tps, lat 3.224 ms stddev 4.146
progress: 3110.0 s, 14479.1 tps, lat 3.435 ms stddev 4.435
progress: 3120.0 s, 10904.9 tps, lat 4.567 ms stddev 8.610
progress: 3130.0 s, 15146.8 tps, lat 3.283 ms stddev 4.209
progress: 3140.0 s, 15200.2 tps, lat 3.272 ms stddev 4.184
progress: 3150.0 s, 11884.1 tps, lat 4.189 ms stddev 6.530
progress: 3160.0 s, 14919.6 tps, lat 3.333 ms stddev 4.259
progress: 3170.0 s, 14945.6 tps, lat 3.328 ms stddev 4.228
progress: 3180.0 s, 14200.7 tps, lat 3.502 ms stddev 4.714
progress: 3190.0 s, 11885.3 tps, lat 4.189 ms stddev 6.669
progress: 3200.0 s, 14886.4 tps, lat 3.341 ms stddev 4.250
progress: 3210.0 s, 13903.9 tps, lat 3.578 ms stddev 4.712
progress: 3220.0 s, 11378.7 tps, lat 4.375 ms stddev 7.007
progress: 3230.0 s, 14853.9 tps, lat 3.349 ms stddev 4.203
progress: 3240.0 s, 15044.2 tps, lat 3.306 ms stddev 4.186
progress: 3250.0 s, 11240.2 tps, lat 4.428 ms stddev 6.613
progress: 3260.0 s, 14628.1 tps, lat 3.399 ms stddev 4.263
progress: 3270.0 s, 14826.4 tps, lat 3.358 ms stddev 4.246
progress: 3280.0 s, 14328.9 tps, lat 3.471 ms stddev 4.311
progress: 3290.0 s, 11756.7 tps, lat 4.234 ms stddev 6.090
progress: 3300.0 s, 14709.0 tps, lat 3.382 ms stddev 4.270
progress: 3310.0 s, 13693.6 tps, lat 3.636 ms stddev 5.028
progress: 3320.0 s, 10993.3 tps, lat 4.527 ms stddev 7.931
progress: 3330.0 s, 14486.4 tps, lat 3.436 ms stddev 4.333
progress: 3340.0 s, 14501.1 tps, lat 3.431 ms stddev 4.307
progress: 3350.0 s, 12100.8 tps, lat 4.084 ms stddev 7.138
progress: 3360.0 s, 11223.8 tps, lat 4.466 ms stddev 9.070
progress: 3370.0 s, 14792.3 tps, lat 3.365 ms stddev 4.237
progress: 3380.0 s, 13493.8 tps, lat 3.688 ms stddev 4.896
progress: 3390.0 s, 11341.0 tps, lat 4.389 ms stddev 6.302
progress: 3400.0 s, 14257.6 tps, lat 3.491 ms stddev 4.303
progress: 3410.0 s, 14498.3 tps, lat 3.430 ms stddev 4.265
progress: 3420.0 s, 10440.8 tps, lat 4.768 ms stddev 8.576
progress: 3430.0 s, 12736.1 tps, lat 3.911 ms stddev 5.106
progress: 3440.0 s, 14245.6 tps, lat 3.492 ms stddev 4.345
progress: 3450.0 s, 12678.0 tps, lat 3.925 ms stddev 6.593
progress: 3460.0 s, 12095.4 tps, lat 4.115 ms stddev 5.113
progress: 3470.0 s, 14086.6 tps, lat 3.533 ms stddev 4.400
progress: 3480.0 s, 14069.4 tps, lat 3.538 ms stddev 4.389
progress: 3490.0 s, 10019.3 tps, lat 4.968 ms stddev 7.886
progress: 3500.0 s, 13978.5 tps, lat 3.561 ms stddev 4.377
progress: 3510.0 s, 14075.2 tps, lat 3.534 ms stddev 4.383
progress: 3520.0 s, 13124.2 tps, lat 3.794 ms stddev 5.119
progress: 3530.0 s, 10314.1 tps, lat 4.829 ms stddev 7.853
progress: 3540.0 s, 13970.0 tps, lat 3.559 ms stddev 4.384
progress: 3550.0 s, 13007.4 tps, lat 3.827 ms stddev 5.910
progress: 3560.0 s, 10481.9 tps, lat 4.754 ms stddev 6.653
progress: 3570.0 s, 13688.7 tps, lat 3.633 ms stddev 4.432
progress: 3580.0 s, 14020.0 tps, lat 3.551 ms stddev 4.377
progress: 3590.0 s, 12055.4 tps, lat 4.127 ms stddev 6.095
progress: 3600.0 s, 10880.4 tps, lat 4.579 ms stddev 6.446
transaction type: pgbench_write_orioledb.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 5
duration: 3600 s
number of transactions actually processed: 89225740
latency average = 1.995 ms
latency stddev = 3.237 ms
tps = 24784.837746 (including connections establishing)
tps = 24784.874305 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set region_id 0
         0.005  \set ns_id random_zipfian(1, 10, 1.1)
         0.002  \set emitter random_zipfian(1000, 3000, 1.1)
         0.001  \set root_player_id random(1, 100000*:scale)
         0.003  \set currency_id random_zipfian(1, 50, 1.1)
         0.000  \set amount random(1, 10000)
         0.099  BEGIN;
         0.577  INSERT INTO trx_pgbench_0
         0.358  INSERT INTO op_pgbench_0
         0.277  INSERT INTO balance_version_pgbench_0
         0.343  INSERT INTO balance_pgbench_0
         0.330  END;